In [1]:
import pandas as pd
import numpy as np
import psycopg2
import os

/home/ec2-user/anaconda3/envs/python3/lib/python3.6/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [2]:
# Grab config
HOST = os.environ.get('DB_HOST') or "st-deploy-ds-apps-db.cypzti2esilk.us-east-1.rds.amazonaws.com"
DB_NAME = os.environ.get('DB_NAME') or "stdemo"
USER = os.environ.get('DB_USER') or "odsc"
PASSWORD = os.environ.get('DB_PASSWORD') or "password"

In [3]:
# now we will create the postgres tables and insert rows from the lists we created
# open our connection
try: 
    conn = psycopg2.connect(f"host={HOST} dbname={DB_NAME} user={USER} password={PASSWORD}")
except psycopg2.Error as e: 
    print("Error: Could not make connection to the Postgres database")
    print(e)

In [4]:
pd.read_sql_query("SELECT * FROM users", conn).head()

   id
0   1
1   2
2   3
3   4
4   5

In [5]:
pd.read_sql_query("SELECT * FROM rooms", conn).head()

   id
0   1
1   2
2   3
3   4
4   5

In [6]:
pd.read_sql_query("SELECT * FROM messages", conn).head()

   id  user_id  room_id mention_ids
0   1      544      135         329
1   2      727       71         839
2   3      458       27         579
3   4      266      145         656
4   5       30      148     624,641

In [7]:
pd.read_sql_query("SELECT * FROM follows", conn).head()

   id  user_id  following_user_id
0   1        1                908
1   2        1                841
2   3        1                117
3   4        1                 14
4   5        1                633

In [8]:
pd.read_sql_query("SELECT * FROM likes", conn).head()

   id  user_id  message_id
0   1      676           1
1   2      513           1
2   3      863           1
3   4      654           1
4   5      762           1

In [9]:
pd.read_sql_query("SELECT * FROM subscriptions", conn).head()

   id  user_id  room_id
0   1        1      119
1   2        8      119
2   3       29      119
3   4       51      119
4   5       55      119